tutorials/discInConstantPorousFlow_test/RESULTS_porousInterIsoFoam_Co_0.25_nAlphaSubCycles_0/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
touch case.foam

runApplication blockMesh

runApplication setAlphaField
runApplication setFields

runApplication $(getApplication)

foamLog log.por*
#-----------------------------------------------------------------------#